{
  "versions": [
    {
      "name": "1.5.11",
      "description": "Patch release with critical bug fixes and performance improvements.\n\n✨ Features:\n- Added new OpenAI reasoning models with comprehensive test coverage.\n- Introduced DataFrame output to Structured Output component with backward compatibility.\n- Enhanced DataFrame Operations with 7 filter operators including contains, starts with, ends with.\n- Integrated JigsawStack bundle with improved UI components.\n- Added PowerShell curl tab support with OS selector functionality.\n- Implemented dynamic theming for WatsonxAI icon with dark mode detection.\n\n🔧 Improvements:\n- Enhanced MCP health checks with session connectivity validation and improved JSON recognition.\n- Refactored authentication flow by removing unnecessary settings_service dependencies.\n- Improved modal responsiveness and overflow handling across components.\n- Updated API Access to show only authenticated code examples.\n- Enhanced file component descriptions and download functionality with custom hooks.\n- Standardized cache service type hints and error handling patterns.\n\n🐛 Bug Fixes:\n- Fixed edge clearing issues when switching outputs with same type but different names.\n- Resolved file deletion problems by ensuring proper database commits.\n- Fixed MCP server component cache miss handling gracefully.\n- Corrected flow_id validation to prevent None value logging errors.\n- Fixed scroll behavior in update components review dialog.\n- Resolved EventLoopBlockError in CI preventing test failures.\n- Fixed auto_login authentication checks and file path uniqueness.\n\n🧰 Chores:\n- Updated package versions with post-release tags for consistency.\n- Enabled CodeRabbit guidelines for improved code quality.\n- Updated GitHub Actions workflows and dependency management.\n- Removed CrewAI dependencies and added proper import guards.\n- Improved regex patterns for PEP 440 version suffix support.",
      "url": "https://github.com/langflow-ai/langflow-desktop/releases/tag/1.5.11",
      "date": "2025/07/11",
      "signature": "N/A"
    },
    {
      "name": "1.5.1",
      "description": "Minor release with bug fixes and improvements. Database path migration.",
      "url": "https://github.com/langflow-ai/langflow-desktop/releases/tag/1.5.1",
      "date": "2025/07/10",
      "signature": "N/A"
    },
    {
      "name": "1.5.0",
      "description": "Major release with version bump to 1.5.0 and significant improvements.\n\n✨ Features:\n- Added new hooks and utilities for single and bulk file downloads.\n- Integrated @tauri-apps/plugin-dialog for native dialogs.\n- Introduced tray icon support with theme detection and manual update checks.\n- Added new custom components for flexible UI (CustomMcpServerTab, CustomFetchErrorComponent, CustomUpdateAvailableDialog).\n- Added support for local connection checks in Tauri Desktop scenarios.\n\n🔧 Improvements:\n- Refactored modules for better maintainability and readability.\n- Added dark mode support and improved styling.\n- Standardized proxy targets and constants to port 7860.\n- Improved Windows paths, environment setup, and file exports.\n\n🐛 Bug Fixes:\n- Fixed feature flags, environment checks, port conflicts, and redundant logs.\n- Resolved path handling for virtual environments.\n\n🧰 Chores:\n- Synced frontend/backend versions.\n- Updated documentation, logs, and release modal.\n- Cleaned up path management across platforms.",
      "url": "https://github.com/langflow-ai/langflow-desktop/releases/tag/1.5.0",
      "date": "2025/07/09",
      "signature": "N/A"
    },
    {
      "name": "1.4.22",
      "description": "Patch release with frontend enhancements, new components, and improved system compatibility.\n\n🚀 Features:\n- Added support for user dependency installation during setup.\n- Introduced custom chat input and file input components for better UX and customization.\n- Integrated new file upload hooks with improved error handling and progress tracking.\n\n🧰 Chores:\n- Adjusted window size and centering behavior at startup for better multi-monitor experience.\n- Lowered macOS minimumSystemVersion to 13.0 for wider compatibility.\n- Synchronized versioning and metadata in Cargo.toml, manifest.json, and tauri.conf.json.\n\n💅 Frontend Improvements:\n- Refactored multiple components for better naming, semantics, and responsiveness.\n- Added neon glow animation to update indicators.\n- Improved layout responsiveness and UI consistency for mobile and desktop.\n\n📄 Misc:\n- Removed hardcoded versioning in `custom-get-app-latest-version.ts`.\n- Improved loading screen structure and updated unused imports.",
      "url": "https://github.com/langflow-ai/langflow-desktop/releases/tag/1.4.22",
      "date": "2025/05/22",
      "signature": "N/A"
    },
    {
      "name": "1.4.21",
      "description": "Patch release with frontend improvements, bug fixes, and versioning updates.\n\n🛠️ Improvements:\n- Window resizing updated to 85% screen width without auto-centering to prevent jumping between monitors.\n- Dark mode logic improved using useTheme hook for consistent body class behavior.\n- Version numbers updated across configuration files (package.json, lib.rs, tauri configs) to follow semantic versioning with patch identifiers.\n- New Makefile target `sync_frontend` added to streamline frontend sync for Langflow integration.\n\n🐛 Bug Fixes:\n- Prevented click event propagation in custom-langflow-counts.tsx to avoid unintended behavior.\n- Fixed `disabled` logic in custom-parameter.tsx to respect edge and tool mode conditions.\n- Corrected progress calculation in get-started-progress.tsx to display accurate completion percentages.",
      "url": "https://github.com/langflow-ai/langflow-desktop/releases/tag/1.4.21",
      "date": "2025/05/22",
      "signature": "N/A"
    },
    {
      "name": "1.4.2",
      "description": "Main release version with tauri updater",
      "url": "N/A",
      "date": "2025/05/20",
      "signature": "N/A"
    }
  ]
}